
///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////
#Область Служебные_функции_и_процедуры

&НаКлиенте
// контекст фреймворка Vanessa-ADD
Перем Ванесса;

&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;

&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-ADD.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;

	ВсеТесты = Новый Массив;
	Возврат ВсеТесты;
КонецФункции

&НаКлиенте
Функция ПолучитьМакетОбработки(ИмяФайла) Экспорт
	ИмяФайлаОбработки 	= ИспользуемоеИмяФайла();
	КаталогОбработки 	= Лев(ИмяФайлаОбработки,СтрНайти(ИмяФайлаОбработки,"\step_definitions\"));
	ИмяФайлаМакета 		= "";
	Если Лев(ИмяФайла,2) = ".\" Тогда
		ИмяФайлаМакета 	= КаталогОбработки + "ИсходныеДанные\" + Прав(ИмяФайла,СтрДлина(ИмяФайла)-2);
	Иначе
		ИмяФайлаМакета 	= КаталогОбработки + "ИсходныеДанные\" + ИмяФайла;
	КонецЕсли;
	
	Файл 				= Новый Файл(ИмяФайлаМакета);
	Если Не Файл.Существует() Тогда
		Сообщить("Template.ПолучитьМакетОбработки: Не удалось найти файл " + ИмяФайлаМакета);		
		ТекстовыйДокумент	= Новый ТекстовыйДокумент;
		ТекстовыйДокумент.ДобавитьСтроку("Ой что то пошло не так");
		Возврат ТекстовыйДокумент;
	КонецЕсли;

	ЭтоТабличныйДокумент  = Ложь;
	Если СтрЗаканчиваетсяНа(ИмяФайлаМакета,".mxl") Тогда
		ЭтоТабличныйДокумент = Истина;
	ИначеЕсли НЕ СтрЗаканчиваетсяНа(ИмяФайлаМакета,".json") Тогда
		ИмяФайлаМакета 	= ИмяФайлаМакета + ".json";
	КонецЕсли;
	
	ДвоичныеДанные 		= Новый ДвоичныеДанные(ИмяФайлаМакета);
	АдресХранилища 		= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор);
	
	Возврат ПолучитьМакетСервер(АдресХранилища, ЭтоТабличныйДокумент);	 	
КонецФункции

&НаСервере
Функция ИспользуемоеИмяФайла()
	Возврат РеквизитФормыВЗначение("Объект").ИспользуемоеИмяФайла;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМакетСервер(АдресХранилища, ЭтоТабличныйДокумент)
	Если ЭтоТабличныйДокумент Тогда
		ИмяФайла 			= ПолучитьИмяВременногоФайла(".mxl");
	Иначе
		ИмяФайла 			= ПолучитьИмяВременногоФайла(".json");
	КонецЕсли;
	ДвоичныеДанные 			= ПолучитьИзВременногоХранилища(АдресХранилища);
	ДвоичныеДанные.Записать(ИмяФайла);
	Если ЭтоТабличныйДокумент Тогда
		ТекстовыйДокумента  	= Новый ТабличныйДокумент;
		ТекстовыйДокумента.Прочитать(ИмяФайла);
	Иначе
		ТекстовыйДокумента  	= Новый ТекстовыйДокумент;
		ТекстовыйДокумента.Прочитать(ИмяФайла);
	КонецЕсли;
	Возврат ТекстовыйДокумента;	
КонецФункции

#КонецОбласти

#Область Работа_со_сценариями

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт

КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт 	
	Для Каждого КлиентТестирования Из Ванесса.ДанныеКлиентовТестирования Цикл
 		Команда = "powershell.exe -ExecutionPolicy ""Bypass"" -Command ""& " + Ванесса.Объект.КаталогПроекта + "\script\killProcess1c.ps1 -port %ПортТестКлиента%""";
		Команда = СтрЗаменить(Команда,"%ПортТестКлиента%", Формат(КлиентТестирования.ПортЗапускаТестКлиента,"ЧГ=0"));
		ЗапуститьПриложение(Команда,,Истина);
	КонецЦикла;
	ПередОкончаниемСценарияСервер(); 	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПередОкончаниемСценарияСервер() 
	Попытка 		
		УстановитьМонопольныйРежим(Истина);
		УдалитьДанныеИнформационнойБазы();
		УстановитьМонопольныйРежим(Ложь);
	Исключение
	КонецПопытки;
КонецПроцедуры

#КонецОбласти
